#+BEGIN_COMMENT
.. title: Simple Python Recursion Example
.. slug: python-stuff
.. date: 2019-06-28 23:20:30 UTC-04:00
.. tags: python, meta, blogging, emacs, babel
.. category: Programming
.. link: 
.. description: Testing out babel with python
.. type: text

#+END_COMMENT

#+BEGIN_SRC python :session
  def fact(num):
      if num == 1:
          return num
      else:
          return num * fact(num - 1);

  fact(3)
#+END_SRC

#+RESULTS:
: 6
